export const heads = [
  "",
  "מה",
  "מה לא",
  "מה אין",
  "מה איננה",
  "מה אינו",
  "למה",
];

export const tails = [
  { type: -1, tail: "" },
  { type: 0, tail: "אסור/מותר?" },
  { type: 1, tail: "נהוג/ראוי?" },
  { type: 2, tail: "עשוי לקרות להערכתו של מישהו?" },
  { type: 2, tail: "קרה להערכתו של מישהו?" },
  { type: 3, tail: "בכוונתו של מישהו לעשות?" },
  { type: 3, tail: "מטרתו של מישהו?" },
  { type: 4, tail: "ברצונו של מישהו?" },
  { type: 4, tail: "מתחשק למישהו?" },
  { type: 5, tail: "הנסיבות מאפשרות?" },
  { type: 5, tail: "הנסיבות לא מאפשרות?" },
  { type: 5, tail: "הסיטואציה גורמת?" },
  { type: 5, tail: "הסיטואציה לא גורמת?" },
  { type: 5, tail: "יתאפשר/יקרה בהינתן ______?" },
  { type: 6, tail: "ביכולתו/בכוחו של מישהו?" },
  { type: 7, tail: "הייעוד של משהו/מישהו?" },
  { type: -1, tail: "קרה/יקרה?" },
];

export const followUps = [
  "איזו מילה/מילים הובילו אותך לחשוב על מה שמותר/אסור?",
  "איזו מילה/מילים הובילו אותך לחשוב על מה שנהוג/ראוי?",
  "איזו מילה/מילים הובילו אותך לחשוב על הערכה?",
  "איזו מילה/מילים הובילו אותך לחשוב על כוונה או מטרה?",
  "איזו מילה/מילים הובילו אותך לחשוב על חשק או רצון?",
  "איזו מילה/מילים הובילו אותך לחשוב על נסיבות או סיטואציה?",
  "איזו מילה/מילים הובילו אותך לחשוב על יכולת?",
  "איזו מילה/מילים הובילו אותך לחשוב על ייעוד?",
];
